odIfcInitModelerGeometry(ModelerType)
\details
Initializes IFC SDK Modeler functionality.
\param modelerType[in] A type of the modeler that is used to create the geometry.
\returns eOk if IFC SDK Modeler was successfully initialized; otherwise, the function returns an appropriate error code.